### Terraform Plan — `linode-us`
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cluster.linode_lke_cluster.this will be created
  + resource "linode_lke_cluster" "this" {
      + api_endpoints = (known after apply)
      + apl_enabled   = (known after apply)
      + dashboard_url = (known after apply)
      + id            = (known after apply)
      + k8s_version   = "1.34"
      + kubeconfig    = (sensitive value)
      + label         = "creatium-us"
      + region        = "us-east"
      + status        = (known after apply)
      + tags          = [
          + "creatium",
          + "production",
          + "us-east",
        ]
      + tier          = (known after apply)

      + control_plane (known after apply)

      + pool {
          + count           = 1
          + disk_encryption = (known after apply)
          + id              = (known after apply)
          + nodes           = (known after apply)
          + type            = "g6-standard-2"
        }
    }

  # module.compute_pool.linode_lke_node_pool.this will be created
  + resource "linode_lke_node_pool" "this" {
      + cluster_id      = (known after apply)
      + disk_encryption = (known after apply)
      + id              = (known after apply)
      + k8s_version     = (known after apply)
      + labels          = {}
      + node_count      = 1
      + nodes           = (known after apply)
      + tags            = [
          + "creatium",
          + "pool:compute",
        ]
      + type            = "g6-dedicated-8"
      + update_strategy = (known after apply)

      + autoscaler {
          + max = 5
          + min = 1
        }
    }

  # module.general_pool.linode_lke_node_pool.this will be created
  + resource "linode_lke_node_pool" "this" {
      + cluster_id      = (known after apply)
      + disk_encryption = (known after apply)
      + id              = (known after apply)
      + k8s_version     = (known after apply)
      + labels          = {}
      + node_count      = 1
      + nodes           = (known after apply)
      + tags            = [
          + "creatium",
          + "pool:general",
        ]
      + type            = "g6-standard-4"
      + update_strategy = (known after apply)

      + autoscaler {
          + max = 8
          + min = 1
        }
    }

  # module.networking.linode_firewall.cluster will be created
  + resource "linode_firewall" "cluster" {
      + created         = (known after apply)
      + devices         = (known after apply)
      + disabled        = false
      + id              = (known after apply)
      + inbound_policy  = "DROP"
      + label           = "creatium-us-firewall"
      + linodes         = (known after apply)
      + nodebalancers   = (known after apply)
      + outbound_policy = "ACCEPT"
      + status          = (known after apply)
      + tags            = [
          + "creatium",
          + "us-east",
        ]
      + updated         = (known after apply)

      + inbound {
          + action      = "ACCEPT"
          + ipv4        = [
              + "0.0.0.0/0",
            ]
          + ipv6        = [
              + "::/0",
            ]
          + label       = "allow-https"
          + ports       = "443"
          + protocol    = "TCP"
            # (1 unchanged attribute hidden)
        }
      + inbound {
          + action      = "ACCEPT"
          + ipv4        = [
              + "0.0.0.0/0",
            ]
          + ipv6        = [
              + "::/0",
            ]
          + label       = "allow-http"
          + ports       = "80"
          + protocol    = "TCP"
            # (1 unchanged attribute hidden)
        }
      + inbound {
          + action      = "ACCEPT"
          + ipv4        = [
              + "0.0.0.0/0",
            ]
          + label       = "allow-kube-api"
          + ports       = "6443"
          + protocol    = "TCP"
            # (1 unchanged attribute hidden)
        }
      + inbound {
          + action      = "ACCEPT"
          + ipv4        = [
              + "0.0.0.0/0",
            ]
          + ipv6        = [
              + "::/0",
            ]
          + label       = "allow-nodeports"
          + ports       = "30000-32767"
          + protocol    = "TCP"
            # (1 unchanged attribute hidden)
        }
    }

  # module.system_pool.linode_lke_node_pool.this will be created
  + resource "linode_lke_node_pool" "this" {
      + cluster_id      = (known after apply)
      + disk_encryption = (known after apply)
      + id              = (known after apply)
      + k8s_version     = (known after apply)
      + labels          = {}
      + node_count      = 1
      + nodes           = (known after apply)
      + tags            = [
          + "creatium",
          + "pool:system",
        ]
      + type            = "g6-standard-2"
      + update_strategy = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_id = (known after apply)
  + kubeconfig = (sensitive value)

```